export const INFO_TEXT = `
*Ինֆորմացիա Telegram բոտի մասին*  

Այս բոտը նախատեսված է տրամադրելու տեղեկատվություն էլեկտրաէներգիայի անջատումների վերաբերյալ: Տվյալները վերցվում են [ena.am](https://ena.am) կայքից, և բոտը ամեն օր թարմացվում է ժամը *20:00*-ին:  

Եթե դուք գտել եք որևէ սխալ կամ անհամապատասխանություն բոտի տրամադրած տվյալներում, խնդրում ենք այցելել [ena.am](https://ena.am) պաշտոնական կայք՝ ավելի մանրամասն և ճշգրիտ տեղեկատվություն ստանալու համար:  

Բոտը ստեղծված է, որպեսզի հեշտացնի օգտատերերի առօրյան՝ տրամադրելով հարմարավետ և արագ հասանելի տվյալներ. 😊
`;

export const POWER_OUTAGES_TEXT =
  "Մուտքագրեք *Հասցե*՝ էլ․ խափանումները ստանալու համար։\nՕրինակ․ *Երևան* կամ մուտքագրեք *all*՝ բոլոր տվյալները ստանալու համար։";

export const FOLLOW_PROMPT_TEXT =
  "Մուտքագրեք հասցե (ները), որի (որոնց) համար ցանկանում եք ստանալ տեղեկություններ։\n\n" +
  "Օրինակ․ *Երևան* կամ մեկից ավելի դեպքում *Նոր Նորք, Կոմիտաս*";
export const FOLLOW_EXIT_TEXT = "Հաջողությամբ դուրս եք եկել Հետևել հրամանից․․․";

export const FOLLOW_EDIT_TEXT =
  "Մուտքագրեք նոր հասցեն(ները)։\n\nՕրինակ․ *Երևան*, *Նոր Նորք, Կոմիտաս*";
export const FOLLOW_DELETE_TEXT = "Հաջողությամբ ջնջվել է։";

export const INCORRECT_COMMAND_TEXT = "Անհայտ տարբերակ է ընտրվել";

export const ARMENIAN_REGIONS = [
  "Երևան",
  "Արագածոտն",
  "Գեղարքունիք",
  "Արարատ",
  "Արմավիր",
  "Կոտայք",
  "Լոռի",
  "Շիրակ",
  "Սյունիք",
  "Տավուշ",
  "Վայոց Ձոր",
];

export type ArmenianRegion = (typeof ARMENIAN_REGIONS)[number];
